services/catalog-service/src/main/resources/wsdl/CatalogService.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions
    name="CatalogService"
    targetNamespace="http://catalog.globalbooks.com/"
    xmlns:tns="http://catalog.globalbooks.com/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">

  <!-- Types -->
  <types>
    <xsd:schema targetNamespace="http://catalog.globalbooks.com/" elementFormDefault="qualified">

      <!-- Book type -->
      <xsd:complexType name="book">
        <xsd:sequence>
          <xsd:element name="isbn" type="xsd:string"/>
          <xsd:element name="title" type="xsd:string"/>
          <xsd:element name="author" type="xsd:string"/>
          <xsd:element name="category" type="xsd:string"/>
          <xsd:element name="price" type="xsd:double"/>
          <xsd:element name="stock" type="xsd:int"/>
        </xsd:sequence>
      </xsd:complexType>

      <!-- SearchBooksRequest -->
      <xsd:element name="searchBooksRequest">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element name="query" type="xsd:string" minOccurs="0"/>
            <xsd:element name="category" type="xsd:string" minOccurs="0"/>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>

      <!-- SearchBooksResponse -->
      <xsd:element name="searchBooksResponse">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element name="books" type="tns:book" minOccurs="0" maxOccurs="unbounded"/>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>

      <!-- GetBookByIdRequest -->
      <xsd:element name="getBookByIdRequest">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element name="bookId" type="xsd:string"/>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>

      <!-- GetBookByIdResponse -->
      <xsd:element name="getBookByIdResponse">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element name="book" type="tns:book" minOccurs="0"/>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>

      <!-- GetBookPriceRequest -->
      <xsd:element name="getBookPriceRequest">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element name="bookId" type="xsd:string"/>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>

      <!-- GetBookPriceResponse -->
      <xsd:element name="getBookPriceResponse">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element name="price" type="xsd:double"/>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>

      <!-- CheckAvailabilityRequest -->
      <xsd:element name="checkAvailabilityRequest">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element name="bookId" type="xsd:string"/>
            <xsd:element name="quantity" type="xsd:int"/>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>

      <!-- CheckAvailabilityResponse -->
      <xsd:element name="checkAvailabilityResponse">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element name="available" type="xsd:boolean"/>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>

    </xsd:schema>
  </types>

  <!-- Port type (operations) -->
  <wsdl:portType name="CatalogPortType">
    <wsdl:operation name="searchBooks">
      <wsdl:input message="tns:searchBooksRequest"/>
      <wsdl:output message="tns:searchBooksResponse"/>
    </wsdl:operation>

    <wsdl:operation name="getBookById">
      <wsdl:input message="tns:getBookByIdRequest"/>
      <wsdl:output message="tns:getBookByIdResponse"/>
    </wsdl:operation>

    <wsdl:operation name="getBookPrice">
      <wsdl:input message="tns:getBookPriceRequest"/>
      <wsdl:output message="tns:getBookPriceResponse"/>
    </wsdl:operation>

    <wsdl:operation name="checkAvailability">
      <wsdl:input message="tns:checkAvailabilityRequest"/>
      <wsdl:output message="tns:checkAvailabilityResponse"/>
    </wsdl:operation>
  </wsdl:portType>

  <!-- Messages -->
  <wsdl:message name="searchBooksRequest">
    <wsdl:part name="parameters" element="tns:searchBooksRequest"/>
  </wsdl:message>
  <wsdl:message name="searchBooksResponse">
    <wsdl:part name="parameters" element="tns:searchBooksResponse"/>
  </wsdl:message>

  <wsdl:message name="getBookByIdRequest">
    <wsdl:part name="parameters" element="tns:getBookByIdRequest"/>
  </wsdl:message>
  <wsdl:message name="getBookByIdResponse">
    <wsdl:part name="parameters" element="tns:getBookByIdResponse"/>
  </wsdl:message>

  <wsdl:message name="getBookPriceRequest">
    <wsdl:part name="parameters" element="tns:getBookPriceRequest"/>
  </wsdl:message>
  <wsdl:message name="getBookPriceResponse">
    <wsdl:part name="parameters" element="tns:getBookPriceResponse"/>
  </wsdl:message>

  <wsdl:message name="checkAvailabilityRequest">
    <wsdl:part name="parameters" element="tns:checkAvailabilityRequest"/>
  </wsdl:message>
  <wsdl:message name="checkAvailabilityResponse">
    <wsdl:part name="parameters" element="tns:checkAvailabilityResponse"/>
  </wsdl:message>

  <!-- Binding (SOAP 1.1, document/literal wrapped) -->
  <wsdl:binding name="CatalogSoapBinding" type="tns:CatalogPortType">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="searchBooks">
      <soap:operation soapAction="urn:searchBooks" />
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>

    <wsdl:operation name="getBookById">
      <soap:operation soapAction="urn:getBookById" />
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>

    <wsdl:operation name="getBookPrice">
      <soap:operation soapAction="urn:getBookPrice" />
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>

    <wsdl:operation name="checkAvailability">
      <soap:operation soapAction="urn:checkAvailability" />
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>

  <!-- Service + Port -->
  <wsdl:service name="CatalogService">
    <wsdl:port name="CatalogPort" binding="tns:CatalogSoapBinding">
      <soap:address location="http://localhost:8080/catalog/soap"/>
    </wsdl:port>
  </wsdl:service>
</definitions>